import './Blog.css';
import React from 'react';

class Reflection1 extends React.Component {
  render() {
    return (
      <body>
        <div className="App">
            <p className='header'>Reflection 1</p>
            <div className='blog-content'>
                <p className='blog-date'>8/6/2022</p>
                <p>我感觉我会做很多事情，但是又非常发散，没有一个系统。对自己没有深刻的理解，经常反思世界，但是不反思自己。
                我自己是一个很愤世嫉俗的人。我不喜欢我的这一点。我自己总是会有各种各样不积极的想法，但是我不喜欢跟别人说，
                因为我要是跟别人说别人也不会接受我，反而只会评判我。我总觉得别人不和我的心意，不懂我，只评判我从不理解我。
                感觉越负面，越不愿意跟别人说，越不愿意跟别人说，感觉越负面。最后就是一个恶性循环，自己噎着难受。就总感觉
                身边的人都特么傻，那么明显的事情自己看不清楚。我自己也知道自己是陷入了自己个人的角色，但是我不知道该
                怎么样才能让自己感觉更“合适”。我感觉可能我的一大想法就是，事实就是事实，做的不好就是做的不好，不应该不接
                受批评或者听着不顺耳的话。</p>
                <p>话说到此，感觉确实我应该和身边的某些人保持距离。交往起来太不舒服。不舒服就各走各的路。不就是这样的道理吗。
                同时自己也不应该有话或者有想法自己噎着不说，有真实的想法就要真实的说，做人就是要真实。赤裸裸的活着就是最
                舒服的生活方法。我感觉这样活着真的好难好艰苦，但是大概这才是最好的方法。</p><br></br>

                <p>说到这里，有一个问题就是不知道为何产生的感觉。如果有一个你不知道为什么会有的感觉，那肯定就会惊慌失措，不
                知道该怎么办。有的时候自己也不知道自己的真实心情是什么。不知道怎样做才是正确的呢。在我的情况下，我可能会
                想去交流是因为什么让我感觉不好的，追溯根源，这样不用自己多瞎想，想出一些奇奇怪怪完全和事实不符的想法。</p>
                <br></br>
                <p>那么又如何对待自己之前所受到的创伤呢？这个可能还是得和心理医生交流。我的心理创伤是第一次crush一个人，鼓
                起勇气跟他表白，结果他leave me on read. 我怎么尝试跟他说话他都不回复我。我觉得这个真的很心伤，但是如果
                对方不希望和我有过度交流，我就应该接受这个界限。我从没遇见过其他人有这么坚决的界限，但是只要这是对方定下
                的界限，我就应该接受。这真的太伤了，但是也大概也没有什么其他办法😀哎哎....有的时候可能就是不巧吧。</p>
                <br></br>
                <p>总之自己现在的生活也很好，感觉真的没必要纠结以前那么多事情。现在可能是轮到我下界限的时候了。摩拳擦掌欸嘿嘿嘿...</p>
                <br></br>
                <p>说起来我最近看了一些standup comedy，真的好搞笑！感觉是团结世界的力量！感觉他们都特别聪明，特别能体会到
                各种各样不一样的人的角度。但是有一点让我担忧的就是感觉中国人被孤立了出来，感觉有人去印度，没人去中国。这个
                真的不能怪其他人，中国自己不讨好，闭关锁国，然后又有巨大的墙和封锁言论，而且很多人政治想法和美国大众相异，
                有很多人也不支持女权和和平，由于各种原因支持暴力和暴权。但是中国真的还是有其历史原因的我个人感觉。我在中国
                长大，还是遇到了很多爱我的人，好的人，他们都是中国人，都代表着希望。所以真的还是希望能尽管看起来有那么多的
                不同和矛盾，还是能站队同情和支持，不要总是批判和孤立。矛盾太多，又没人真正去聆听和理解，那就真的是死局。双
                方都是一样的。</p>
                <br></br>
                <p>还有很多我自己想反省自己的点。我是在一个极为严格的单亲母亲身边成长大的。她极为相信并喜欢教育我一些洗脑的逻辑，
                比如跟不上进步就会被淘汰啊，苦难让你变得更强大啊， 强者自强啊，念念不忘必有回响之类的。还有一点她自己相信，
                没有明面上讲的话，就是优胜劣汰。她自己提过不止一次，没有明面上宣传，但是这是她的坚定相信的事情。由此影响，我
                也会不由自主地以这种标准来要求别人。我希望我能在这一点上做出改进，当然从意识到问题开始。</p>
                <p>这跟我之前提到的批判别人有关联。我感觉基于事实的批判是好的，但是不现实的过度批判是言语暴力，在我看来就像犯罪
                一样。但是这也和我自己有关，因为我也有时候会用很严厉的理由和语气批判自己。其实谁都不应该收到这样的对待，不管
                是他人还是自己。希望以后能以关照的态度对待自己或是他人。</p>
                <br></br>
                <p>总之就是实事求是，心怀慈悲吧。实事求是相对简单，心怀慈悲我个人是难。</p>
            </div>
        </div>
      </body>
    );
  }
}

export default Reflection1;